load-test.yaml
config:
  target: http://localhost:30001
  phases:
    - duration: 60s
      arrivalRate: 1
      rampTo: 5
      name: warm up
    - duration: 60s
      arrivalRate: 5
      rampTo: 10
      name: load
    - duration: 30s
      arrivalRate: 10
      rampTo: 30
      name: spike
    - duration: 60s
      arrivalRate: 1
      rampTo: 1
      name: cool down

scenarios:
  - name: load-test
    flow:
      - get:
          url: "/cpu"